#include <stdio.h>
#include <locale.h>

int main(void)
{
	setlocale(LC_ALL, "Rus");
	int num, bin = 0, k = 1; //num - число введённое пользователем, bin - число в 2-ой сс, k - вспомогательный коэффициент
	/* Описание программы и приглашение к вводу */
	printf("Данная программа переводит числа из 10-ой системы счисления в двоичную систему\nв виде обратного и дополнительного кода (+ прямой).\n Диапазон допустимых значаений: -127..127\nВведите число: ");
	scanf_s("%d", &num);
	if (num >= 128 || num <= -128) //проверка: входит ли число в диапазон допустимых значений
	{
		printf("Ваше число слишком большое.");
		return 1;
	}
	while (num) //"функция" перевода из 10-ой СС в 2-ю
	{
		bin += (num % 2) * k;
		k *= 10;
		num /= 2;
	}
	/* Проверка: является ли число отрицательным*/
	if (bin < 0) //Действия, если число отрицательное
	{
		int dir;
		bin -= 2 * bin; //модуль введённого числа (fabs приводил программу к сбою)
		if (bin < 10000000) //добавляем 8 битов
			dir = bin + 10000000;
		else
			dir = bin + 1000000000000000; //добавляем 16 битов
		printf("Прямой код: %d\n", dir);
		char cod[16]; //создаём символьный тип данных для поиска обратного кода
		int i = 0;
		do {       // генерируем цифры в обратном порядке
			cod[i++] = dir % 10 + '0';   
		} 
		while ((dir /= 10) > 0);     
		cod[i] = '\0';
		int o, j;
		char p;

		for (o = 0, j = strlen(cod) - 1; o < j; o++, j--) {
			p = cod[o];
			cod[o] = cod[j];
			cod[j] = p;

		}
		for (size_t i = 0; i < strlen(cod); i++) {
			if (cod[i] == '1') {
				cod[i] = '0';
			}
			else if (cod[i] == '0') {
				cod[i] = '1';
			}
		}
		cod[0] = '1';
		printf("Обратный код: ");
		printf(cod);
		int add = 0;
		add = atoi(cod);
		int m = 1;
		while (add % 10 == 1) {
			add /= 10;
			m *= 10;
		}
		if (add % 10 == 0)
			add = (add + 1) * m;
		printf("\nДополнительный код: %d", add);
	}
	else //Действие, если число положительное или равно нулю
		printf("Прямой код: 0%d\nОбратный код: 0%d\nДополнительный код: 0%d\n", bin, bin, bin);
	
	return 0;
}
